artifacts/bench/20260421T130653Z/limit_5000/stdout.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: /scripts/main.js
        output: -

     scenarios: (100.00%) 1 scenario, 3000 max VUs, 50s max duration (incl. graceful stop):
              * main: 5000.00 iterations/s for 20s (maxVUs: 50-3000, exec: run, gracefulStop: 30s)


running (01.0s), 0516/0517 VUs, 1676 complete and 0 interrupted iterations
main   [   5% ] 0516/0517 VUs  01.0s/20s  5000.00 iters/s

running (02.0s), 1011/1011 VUs, 3224 complete and 0 interrupted iterations
main   [  10% ] 1011/1011 VUs  02.0s/20s  5000.00 iters/s

running (03.0s), 1627/1627 VUs, 3543 complete and 0 interrupted iterations
main   [  15% ] 1627/1627 VUs  03.0s/20s  5000.00 iters/s

running (04.0s), 2307/2308 VUs, 4147 complete and 0 interrupted iterations
main   [  20% ] 2307/2308 VUs  04.0s/20s  5000.00 iters/s

running (05.0s), 2883/2884 VUs, 5035 complete and 0 interrupted iterations
main   [  25% ] 2883/2884 VUs  05.0s/20s  5000.00 iters/s
time="2026-04-21T13:06:59Z" level=warning msg="Insufficient VUs, reached 3000 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=main

running (06.0s), 3000/3000 VUs, 5459 complete and 0 interrupted iterations
main   [  30% ] 3000/3000 VUs  06.0s/20s  5000.00 iters/s

running (07.0s), 3000/3000 VUs, 6306 complete and 0 interrupted iterations
main   [  35% ] 3000/3000 VUs  07.0s/20s  5000.00 iters/s

running (08.0s), 3000/3000 VUs, 7265 complete and 0 interrupted iterations
main   [  40% ] 3000/3000 VUs  08.0s/20s  5000.00 iters/s

running (09.0s), 3000/3000 VUs, 7732 complete and 0 interrupted iterations
main   [  45% ] 3000/3000 VUs  09.0s/20s  5000.00 iters/s

running (10.0s), 3000/3000 VUs, 8211 complete and 0 interrupted iterations
main   [  50% ] 3000/3000 VUs  10.0s/20s  5000.00 iters/s

running (11.0s), 2999/3000 VUs, 8607 complete and 0 interrupted iterations
main   [  55% ] 2999/3000 VUs  11.0s/20s  5000.00 iters/s

running (12.0s), 2991/3000 VUs, 9108 complete and 0 interrupted iterations
main   [  60% ] 3000/3000 VUs  12.0s/20s  5000.00 iters/s

running (13.0s), 3000/3000 VUs, 9669 complete and 0 interrupted iterations
main   [  65% ] 3000/3000 VUs  13.0s/20s  5000.00 iters/s

running (14.0s), 3000/3000 VUs, 10491 complete and 0 interrupted iterations
main   [  70% ] 3000/3000 VUs  14.0s/20s  5000.00 iters/s

running (15.0s), 3000/3000 VUs, 10974 complete and 0 interrupted iterations
main   [  75% ] 3000/3000 VUs  15.0s/20s  5000.00 iters/s

running (16.0s), 3000/3000 VUs, 11403 complete and 0 interrupted iterations
main   [  80% ] 3000/3000 VUs  16.0s/20s  5000.00 iters/s

running (17.0s), 3000/3000 VUs, 11800 complete and 0 interrupted iterations
main   [  85% ] 3000/3000 VUs  17.0s/20s  5000.00 iters/s

running (18.0s), 3000/3000 VUs, 12340 complete and 0 interrupted iterations
main   [  90% ] 3000/3000 VUs  18.0s/20s  5000.00 iters/s

running (19.0s), 3000/3000 VUs, 12738 complete and 0 interrupted iterations
main   [  95% ] 3000/3000 VUs  19.0s/20s  5000.00 iters/s

running (20.0s), 3000/3000 VUs, 13214 complete and 0 interrupted iterations
main   [ 100% ] 3000/3000 VUs  20.0s/20s  5000.00 iters/s

running (21.0s), 2609/3000 VUs, 13612 complete and 0 interrupted iterations
main ↓ [ 100% ] 3000/3000 VUs  20s  5000.00 iters/s

running (22.0s), 1405/3000 VUs, 14816 complete and 0 interrupted iterations
main ↓ [ 100% ] 3000/3000 VUs  20s  5000.00 iters/s

running (23.0s), 0975/3000 VUs, 15246 complete and 0 interrupted iterations
main ↓ [ 100% ] 3000/3000 VUs  20s  5000.00 iters/s

running (24.0s), 0513/3000 VUs, 15708 complete and 0 interrupted iterations
main ↓ [ 100% ] 3000/3000 VUs  20s  5000.00 iters/s

running (25.0s), 0043/3000 VUs, 16178 complete and 0 interrupted iterations
main ↓ [ 100% ] 3000/3000 VUs  20s  5000.00 iters/s
time="2026-04-21T13:07:19Z" level=error msg="failed to handle the end-of-test summary" error="Could not save some summary information:\n\t- could not open '/out/summary.json': open /out/summary.json: permission denied"

     ✓ get post 200
     ✓ create post 201
     ✓ like 200
     ✓ hot feed 200

     checks.........................: 100.00% ✓ 16221      ✗ 0     
     data_received..................: 100 MB  4.0 MB/s
     data_sent......................: 2.2 MB  86 kB/s
     dropped_iterations.............: 83778   3348.13191/s
     http_req_blocked...............: avg=149.39µs min=562ns   med=3.53µs  max=190.26ms p(90)=392.66µs p(95)=791.54µs
     http_req_connecting............: avg=107.32µs min=0s      med=0s      max=190.2ms  p(90)=213.49µs p(95)=522.29µs
   ✗ http_req_duration..............: avg=3.62s    min=2.01ms  med=4.4s    max=7.1s     p(90)=5.91s    p(95)=6.37s   
       { expected_response:true }...: avg=3.62s    min=2.01ms  med=4.4s    max=7.1s     p(90)=5.91s    p(95)=6.37s   
   ✓ http_req_failed................: 0.00%   ✓ 0          ✗ 16221 
     http_req_receiving.............: avg=219.36µs min=13.38µs med=72.42µs max=33.95ms  p(90)=477.51µs p(95)=839.95µs
     http_req_sending...............: avg=56.27µs  min=4.25µs  med=17.73µs max=15.4ms   p(90)=78.42µs  p(95)=169.7µs 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=3.62s    min=1.77ms  med=4.4s    max=7.1s     p(90)=5.91s    p(95)=6.37s   
     http_reqs......................: 16221   648.261449/s
     iteration_duration.............: avg=3.62s    min=2.19ms  med=4.4s    max=7.1s     p(90)=5.91s    p(95)=6.37s   
     iterations.....................: 16221   648.261449/s
     vus............................: 43      min=43       max=3000
     vus_max........................: 3000    min=517      max=3000


running (25.0s), 0000/3000 VUs, 16221 complete and 0 interrupted iterations
main ✓ [ 100% ] 0000/3000 VUs  20s  5000.00 iters/s
time="2026-04-21T13:07:19Z" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"